# FieldValues Constructor (FieldValues) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FieldValues Constructor (FieldValues)
FieldValues Class See Also
---
Creates a copy of the given FieldValues instance.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FieldValues(
	FieldValues otherObject
)
```

Visual Basic
---
```text
Public Sub New ( _
	otherObject As FieldValues _
)
```

Visual C++
---
```text
public:
FieldValues(
	FieldValues^ otherObject
)
```

# ### Parameters
otherObject
    Type: Autodesk.Revit.DB.Analysis..::..FieldValues
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FieldValues Class
FieldValues Overload
Autodesk.Revit.DB.Analysis Namespace